# Taps
tap "homebrew/cask-versions"
tap "oven-sh/bun"
tap "railwayapp/tap"
tap "romkatv/powerlevel10k"
tap "supabase/tap"
tap "tw93/tap"

# Core tools
brew "gh"
brew "git-delta"
brew "htop"
brew "httpie"
brew "jq"
brew "ripgrep"
brew "zsh"
brew "hstr"

# Languages & runtimes
brew "nvm"
brew "go"
brew "python@3.12"
brew "ruby-build"
brew "rbenv"

# Mobile development
brew "cocoapods"
brew "watchman"

# Database
brew "libpq"
brew "neonctl"

# Cloud & DevOps
brew "cloudflared"
brew "tw93/tap/mole"

# Shell
brew "direnv"
brew "powerlevel10k"

# Casks
cask "zulu@21"
